Revit 2026 API

# CriticalPathIterator Properties

---

The CriticalPathIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

CriticalPathIterator Class

Autodesk.Revit.DB.Analysis Namespace